<?
$date = '08-20';

if ($date >= '01-01' && $date <= '01-19' || $date >= '12-22' && $date <= '12-31') {
    echo 'Козерог';
} else {
    $zodiac = [
        ['01-20', '02-18', 'Водолей'],
        ['02-19', '03-20', 'Рыбы'],
        ['03-21', '04-19', 'Овен'],
        ['04-20', '05-20', 'Телец'],
        ['05-21', '06-20', 'Близнецы'],
        ['06-21', '07-22', 'Рак'],
        ['07-23', '08-22', 'Лев'],
        ['08-23', '09-22', 'Дева'],
        ['09-23', '10-22', 'Весы'],
        ['10-23', '11-21', 'Скорпион'],
        ['11-22', '12-21', 'Стрелец']
    ];

    foreach ($zodiac as $item) {
        if ($date >= $item[0] && $date <= $item[1]) {
            echo $item[2];
            break;
        }
    }
}
?>